---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsRun.ActualRisersNumber
source: html/96279390-3c60-17bb-30a3-6be20f235db8.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.ActualRisersNumber Property

The actual number of stairs risers in the stairs run.

## Syntax (C#)
```csharp
public int ActualRisersNumber { get; }
```

## Remarks
This is a read-only value.